#+title: Hylinx Mod
#+FILETAGS: :work:
* TODO "Hylinx Mod" [33%]
:PROPERTIES:
:ORDERED:  t
:END:
** what is my goal or intention?
to create a set of factions, planets, and missions for a plant civilization in Endless Sky that is worthy of being included in the main game!
** why am I doing this?
for fun! Also I think it would be really novel, and would add a lot to ES. And I love ES! and also for validation
** DONE plan "Hylinx Mod" [5/5]
:PROPERTIES:
:ORDERED:  t
:END:
*** DONE capture your thoughts on "Hylinx Mod" :think:@computer:
:PROPERTIES:
:EFFORT:   8min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:11]
CLOCK: [2025-06-22 Sun 15:05]--[2025-06-22 Sun 15:11] =>  0:06
:END:
<2025-06-22 Sun 15:30-15:36>
**** questions to ask during an initial project brainstorm
***** what is my goal or intention?
***** what do I already know about this project?
***** what don't I know that I need to find out?
***** what can I read or listen to for relevant ideas?
***** who can I talk to who might provide insights?
*** DONE search for notes related to "Hylinx Mod" and dump them into the "basket" :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:14]
CLOCK: [2025-06-22 Sun 15:11]--[2025-06-22 Sun 15:14] =>  0:03
:END:
<2025-06-22 Sun 15:36-15:40>
**** make sure to scour the project archives as well
*** DONE consolidate the basket of "Hylinx Mod" into a component outline :think:@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:22]
CLOCK: [2025-06-22 Sun 15:14]--[2025-06-22 Sun 15:22] =>  0:08
:END:
<2025-06-22 Sun 15:40-15:44>

*** DONE break down the components of "Hylinx Mod" into smaller ones :think:@computer:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:29]
CLOCK: [2025-06-22 Sun 15:22]--[2025-06-22 Sun 15:29] =>  0:07
:END:
<2025-06-22 Sun 15:44-15:52>

*** DONE sketch out tasks of "Hylinx Mod" :flow:@computer:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-23 Mon 15:04]
CLOCK: [2025-06-23 Mon 14:59]--[2025-06-23 Mon 15:04] =>  0:05
CLOCK: [2025-06-22 Sun 15:35]--[2025-06-22 Sun 15:41] =>  0:06
CLOCK: [2025-06-22 Sun 15:29]--[2025-06-22 Sun 15:30] =>  0:01
:END:
<2025-06-23 Mon 15:10-15:22>

** TODO components [1/8]
:PROPERTIES:
:ORDERED:  t
:END:
*** DONE research [4/4] :@computer:@internet:
**** DONE research what experts think on Intelligent Plants [1/1]
***** DONE look online for and take notes on what experts think on Intelligent Plants
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-23 Mon 15:21]
CLOCK: [2025-06-23 Mon 15:05]--[2025-06-23 Mon 15:21] =>  0:16
:END:
<2025-06-23 Mon 15:22-15:30>
**** DONE research what the existing depictions of Intelligent Plants are [1/1]
***** DONE look online for and take notes on what the existing depictions of Intelligent Plants are
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-24 Tue 15:02]
CLOCK: [2025-06-24 Tue 15:00]--[2025-06-24 Tue 15:02] =>  0:02
CLOCK: [2025-06-23 Mon 15:21]--[2025-06-23 Mon 15:24] =>  0:03
:END:
<2025-06-24 Tue 15:00-15:10>
**** DONE research what conditions would lead to Intelligent Plants [1/1]
***** DONE look online for and take notes on what conditions would lead to Intelligent Plants
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-24 Tue 15:10]
CLOCK: [2025-06-24 Tue 15:02]--[2025-06-24 Tue 15:10] =>  0:08
:END:
<2025-06-24 Tue 15:10-15:20>
**** DONE research existing examples of Plant Intelligence [1/1]
***** DONE look online for and take notes on existing examples of Plant Intelligence
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-24 Tue 15:12]
CLOCK: [2025-06-24 Tue 15:10]--[2025-06-24 Tue 15:12] =>  0:02
:END:
<2025-06-24 Tue 15:20-15:30>
*** TODO discussion [0/2]
**** TODO discuss this project's concept in the ES discord [0/1]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO ask some questions about the Hylinx concept on the ES Discord - ask some questions listed under this entry
- questions to ask
  - is the territory anticlockwise of the Remnant up for grabs for aspiring ES contributors?
  - can this ever fit in ES? if it doesn't fit in ES, will it still be good?
***** WAIT wait for 3 pieces of feedback
**** TODO discuss this project's concept in the ES Github [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO ask some questions about the Hylinx concept on the ES Github - ask some questions listed under this entry
- questions to ask
  - is the territory anticlockwise of the Remnant up for grabs for aspiring ES contributors?
  - can this ever fit in ES? if it doesn't fit in ES, will it still be good?
***** WAIT wait for 3 pieces of feedback
*** TODO first contact mission [0/3]
:PROPERTIES:
:ORDERED:  t
:END:
**** TODO ideas [0/1]
***** TODO brainstorm missions to add to the first contact mission :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
<2025-06-24 Tue 15:35-15:47>
**** TODO goals [0/1]
***** TODO describe my goals for the First Conact Mission :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-24 Tue 15:47-15:55>
**** TODO conversations [0/1]
***** TODO write conversation entries for each of the missions :@computer:think:
:PROPERTIES:
:EFFORT:   30min
:END:
*** TODO jobs [0/2]
:PROPERTIES:
:ORDERED:  t
:END:
**** TODO describe jobs to be done in Hylinx Space :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO remix the existing job definitions into ones that work in Hylinx Space :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
*** TODO ship and outfit "personality" [0/2]
the ES crew have stated that they want all outfits in ES to have pros and cons, instead of one set being Superior in all aspects
**** TODO brainstorm what set of "pros and cons" Hylinx outfits - both generally and faction-specific - might have :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
**** TODO select 3 pros and cons of Hylinx Outfits :@computer:think:convg:
:PROPERTIES:
:EFFORT:   10min
:END:
*** TODO outfits [0/3]
**** TODO cooling [0/3]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 10 cooling outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 cooling outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO write definitions for the cooling outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO energy [/]
***** TODO brainstorm 15 energy outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 5 energy outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO write definitions for the energy outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO weapons [0/3]
***** TODO beam weapons [/]
:PROPERTIES:
:ORDERED:  t
:END:
****** TODO brainstorm 10 beam weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO select 3 beam weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO write definitions for the beam weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO missile weapons [/]
:PROPERTIES:
:ORDERED:  t
:END:
****** TODO brainstorm 10 missile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO select 3 missile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO write definitions for the missile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO projectile weapons [/]
:PROPERTIES:
:ORDERED:  t
:END:
****** TODO brainstorm 10 projectile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO select 3 projectile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
****** TODO write definitions for the projectile weapon outfits of the Hylinx :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
*** TODO ships [0/3]
**** TODO transport [0/3]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 transport ship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:05-15:13>
***** TODO select 3 transport ships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
<2025-06-25 Wed 15:05-15:06>
***** TODO write up definitions for 3 transport ships :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:06-15:14>
**** light freighter [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 light freighter ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:14-15:22>
***** TODO select 3 light freighters :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
<2025-06-25 Wed 15:22-15:23>
***** TODO write up definitions for 3 light freighters :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:23-15:31>
**** heavy freighter [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 heavy freighter ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:36-15:44>
***** TODO select 3 heavy freighters :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
<2025-06-25 Wed 15:44-15:45>
***** TODO write up definitions for 3 heavy freighters :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:45-15:53>
**** light warship [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 light warship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-25 Wed 15:58-16:05>
***** TODO select 3 light warships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
<2025-06-26 Thu 14:30-14:31>
***** TODO write up definitions for 3 light warships :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
<2025-06-26 Thu 14:31-14:39>
**** medium warship [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 medium warship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 medium warships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
***** TODO write up definitions for 3 medium warships :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** heavy warship [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 heavy warship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 heavy warships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
***** TODO write up definitions for 3 heavy warships :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** interceptor [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 interceptor ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 interceptors :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
***** TODO write up definitions for 3 interceptors :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO utility [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 interceptor ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 interceptors :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
***** TODO write up definitions for 3 interceptors :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** TODO drone [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 drone ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 drones :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
***** TODO write up definitions for 3 drones :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
**** carrier [/]
:PROPERTIES:
:ORDERED:  t
:END:
***** TODO brainstorm 5 carrier ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
***** TODO select 3 carriers :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
***** TODO write up definitions for 3 carriers :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
*** placeholder assets [/]
*** TODO assets [0/1]
**** TODO write tasks for each of the ships and outfits that I made :@computer:think:
:PROPERTIES:
:EFFORT:   15min
:END:
***** task format
****** label components with shape, location, and texture
****** draw an outline
****** draw a truer outline
****** fill in color
****** fill in texture
****** add secondary details
****** add ternary details
*** factions [/]
**** Klava [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
**** HyFed [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
**** HyCorps [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
**** Verohata [/]
***** environment [/]
****** territory
****** resources available
***** economics [/]
****** needs
****** imports
****** exports
***** politics [/]
****** governance structure
****** goals
****** "personality"
***** relationships [/]
***** culture [/]
****** values
****** anti-values
*** central aspect [/]
*** factions [/]
**** Klava [/]
**** Verohati [/]
**** HyFed [/]
**** HyCorps [/]
*** species [/]
**** Violetstalk
***** habitat
***** growth
***** reproduction
***** social structure - including family
***** diet
**** Sporadic
***** habitat
***** growth
***** reproduction
***** social structure - including family
***** diet
**** Eyed Vines
***** habitat
***** growth
***** reproduction
***** social structure - including family
***** diet
** TODO finish "Hylinx Mod" [0/1]
:PROPERTIES:
:ORDERED:  t
:END:
*** TODO review my project for packets of work that I could reuse :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
*** TODO review my project to see what went right and what went wrong :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
